# ZoneFailures Properties

---
The BuiltInFailuresZoneFailures type exposes the following members.
| Name| Description
---|---|---
| ZoneExistsNotEnclosedRoom|  Zone has a room not enclosed.
| ZoneNotEnclosed|  Zone not enclosed totally.
| ZonesOverlapWarning|  Zone overlap to another zone or another room.
Top
#### Reference
BuiltInFailuresZoneFailures Class
Autodesk.Revit.DB Namespace